Revit 2024 API
ExportLayerInfo.AddLayerModifier Method
 Adds a project layer modifier to the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void AddLayerModifier(
	LayerModifier layerModifier
)
Visual Basic
Public Sub AddLayerModifier ( _
	layerModifier As LayerModifier _
)
Visual C++
public:
void AddLayerModifier(
	LayerModifier^ layerModifier
)
Parameters
layerModifier
Type: Autodesk.Revit.DB.LayerModifier
 The project layer modifier.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The separator string contains one or more prohibited characters. -or- The modifier type already exists in the layer info.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace